# Taps
tap 'homebrew/cask'

# Binaries
brew 'ack'
brew 'dos2unix'
brew 'fzf'
brew 'geoip'
brew 'go'
brew 'htop'
brew 'jq'
brew 'mas'
brew 'nmap'
brew 'node'
brew 'p7zip'
brew 'terraform'
brew 'tree'
brew 'unrar'
brew 'wget'

# Casks
cask '1password'
cask 'atom'
cask 'evernote'
cask 'firefox'
cask 'github'
cask 'goland'
cask 'google-chrome'
cask 'iterm2'
cask 'little-snitch'
cask 'rubymine'
cask 'vlc'
cask 'webstorm'
